/******************************************************************************
 * track_project_common_define.h - 
 * 
 * Copyright .
 * 
 * DESCRIPTION: - 
 *        各项目不同的宏定义文件,每个项目都存在这样的同名文件，不得重命名
 * 
 * modification history
 * --------------------
 * v1.0   2017-06-30,  chengjun create this file
 * 
 ******************************************************************************/

#ifndef _TRACK_PROJECT_COMMON_DEFINE_H
#define _TRACK_PROJECT_COMMON_DEFINE_H

/****************************************************************************
* Include Files                         包含头文件
*****************************************************************************/
#include "track_os_data_types.h"
#include "kal_public_defs.h"


/*****************************************************************************
 *  Define					宏定义
 *****************************************************************************/

/*项目名称*/
#define TRACK_PROJECT_NAME "JM10"

/*设备ID*/
#define TRACK_DEVICE_ID 0x2015

/*上电开机LED工作时间*/
#define POWER_ON_LED_WORK_TIME_SEC   1800

/*****************************************************************************
* Typedef  Enum         枚举
*****************************************************************************/
typedef enum
{
    MCU_CMD_GET_VERSION,
    MCU_CMD_SET_ACC_ON,
    MCU_CMD_SET_ACC_OFF,
    MCU_CMD_SET_EXTCUT_ENABLE,
    MCU_CMD_SET_EXTCUT_DISABLE,
    MCU_CMD_SET_EXT_ON,
    MCU_CMD_SET_EXT_OFF,
    MCU_CMD_SET_VOLT,
} mcu_uart_cmd_eunm;

/*****************************************************************************
 *  Struct                              数据结构定义
 *****************************************************************************/



/*****************************************************************************
 *  Global Functions			全局变量
 *****************************************************************************/


/*****************************************************************************
 *  Local Functions			本地函数
 *****************************************************************************/


/*****************************************************************************
*  Global Functions                     全局函数
******************************************************************************/
extern void track_drv_syn_le_btaddr();


#endif  /* _TRACK_PROJECT_COMMON_DEFINE_H */

